# vi: ft=ruby
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'wallix/awless'
tap 'teamookla/speedtest'

# languages
# cask 'java'
brew 'python'
brew 'go'
brew 'node'
# brew 'ruby'
brew 'terraform'
brew 'terraform-docs'

# tools
brew 'geoip'
brew 'ag'
brew 'ansible'
brew 'autojump'
brew 'awscli'
# cask 'balenaetcher'
# brew 'bash'
# brew 'bash-completion@2'
brew 'zsh-completions'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'entr'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'git-lfs'
brew 'git-delta'

## gpg utilities
brew 'gnupg'
brew 'pinentry-mac'

# cask 'ngrok'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'jq'
# brew 'jmeter'
brew 'ncdu'
brew 'nmap'
# brew 'platformio'
# brew 'siege'
brew 'speedtest'
brew 'telnet'
brew 'tree'
brew 'neovim'
brew 'wallix/awless/awless'
# brew 'wireshark'
cask 'docker'

brew 'tmuxinator'
brew 'tmux'

# document authoring
brew 'pdftohtml'
# cask 'mactex-no-gui'
# brew 'hugo'
# cask 'skim'

# graphics tools
# cask 'xquartz'
brew 'feh'
brew 'imagemagick'
brew 'gnuplot'
brew 'r'
brew 'ffmpeg'
brew 'graphviz'
brew 'plantuml'

# IDEs
cask 'goland'
cask 'intellij-idea'
# cask 'webstorm'
# cask 'clion'
cask 'visual-studio-code'

# GUI tools
# cask '1password'
cask 'alfred'
cask 'dash'
# cask 'dropbox'
# cask 'google-backup-and-sync'
# cask 'google-chrome'
cask 'iterm2'
cask 'licecap'
cask 'omnigraffle'
# cask 'paw'
cask 'spectacle'
cask 'authy'
# cask 'evernote'
# cask 'slack'
cask 'spotify'
