# vi: ft=ruby
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'wallix/awless'
tap 'teamookla/speedtest'

# languages
cask 'java'
brew 'python'
brew 'go'
brew 'node'
brew 'ruby'
brew 'terraform'

# tools
brew 'geoip'
brew 'ag'
brew 'ansible'
brew 'autojump'
brew 'awscli'
cask 'balenaetcher'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'entr'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'git-lfs'

## gpg utilities
brew 'gnupg'
brew 'pinentry-mac'

cask 'ngrok'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'jmeter'
brew 'ncdu'
brew 'nmap'
brew 'platformio'
brew 'siege'
brew 'speedtest'
brew 'telnet'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wallix/awless/awless'
brew 'wireshark'
cask 'docker'

# graphics tools
cask 'xquartz'
brew 'feh'
brew 'imagemagick'
brew 'gnuplot'
brew 'r'
brew 'ffmpeg'
brew 'graphviz'
brew 'plantuml'

# IDEs
cask 'goland'
cask 'intellij-idea'
cask 'webstorm'
cask 'clion'
cask 'visual-studio-code'

# GUI tools
cask '1password'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'licecap'
cask 'omnigraffle'
cask 'paw'
cask 'spectacle'
cask 'authy'
cask 'evernote'
cask 'slack'
cask 'spotify'
