# vi: ft=ruby
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'wallix/awless'

brew 'mas'

# languages
cask 'java'
brew 'python'
brew 'go'
brew 'node', args: ['with-openssl']
brew 'ruby'
brew 'terraform'

# tools
brew 'geoip', args: ['with-geoipupdate']
brew 'ag'
brew 'ansible'
brew 'autojump'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'gnupg', link: false
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'jq'
brew 'jmeter'
brew 'ncdu'
brew 'siege'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['env-std', 'override-system-vim']
brew 'wallix/awless/awless'
cask 'docker'
cask 'gpg-suite'

# graphics tools
brew 'imagemagick', args: ['with-fftw', 'with-fontconfig', 'with-libwmf', 'with-librsvg', 'with-ghostscript', 'with-openjpeg']
brew 'gnuplot', args: ['with-aquaterm', 'with-qt', 'with-pdflib-lite', 'with-cairo' ]
brew 'ffmpeg', args: ['with-freetype', 'with-libvorbis', 'with-theora', 'with-fontconfig', 'with-fdk-aac', 'with-openjpeg', 'with-openh264', 'with-libvpx]brew']
brew 'graphviz'
brew 'plantuml'

# IDEs
cask 'goland'
cask 'intellij-idea'
cask 'webstorm'
cask 'phpstorm'
cask 'visual-studio-code'

# GUI tools
cask '1password'
cask 'alfred'
cask 'dash'
cask 'dropbox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'licecap'
cask 'omnigraffle'
cask 'paw'
cask 'spectacle'

mas 'Xcode', id: 497799835
