ansible
ag
autojump
awless
awscli
bash
bash-completion@2
calc
composer
coreutils
docker
docker-completion
docker-compose
eot-utils
exiftool
ffmpeg, [--with-freetype --with-libvorbis --with-theora --with-fontconfig --with-fdk-aac --with-openjpeg --with-openh264 --with-libvpx]
findutils
gawk
gcc
geoip, [--with-geoipupdate]
gettext
ghostscript
git
git-extras
git-flow-avh
git-lfs
glib
glm
gmp
gnu-getopt
gnu-indent
gnu-sed
gnu-tar
gnuplot
gnutls
go
gource
gradle
graphicsmagick
graphviz
grep
htop
httpie
hub
imagemagick, [--with-fftw --with-fontconfig --with-libwmf --with-librsvg --with-ghostscript --with-openjpeg]
imagesnap
irssi
jmeter
jsonlint
jq
mongodb
mysql
ncdu
nmap
node, [--with-openssl]
openssl@1.1
php-code-sniffer
php71
php71-xdebug
plantuml
postgresql
pyenv
python
python3
rbenv
readline
reattach-to-user-namespace
recode
redis
rename
ruby
sbt
scala
siege
speedtest-cli
sqlite
terminal-notifier
terraform
tig
tmux
tmuxinator-completion
tree
vim, [--env-std --override-system-vim]
wget

